nxp-mcuxpresso/mcux-devices-mcx/MCXE/MCXE247/mcuxpresso/startup_mcxe247.cpp
//*****************************************************************************
// MCXE247 startup code for use with MCUXpresso IDE
//
// Version : 210225
//*****************************************************************************
//
// Copyright 2016-2025 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC push_options
#pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__ ((weak))
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Flash Configuration block : 16-byte flash configuration field that stores
// default protection settings (loaded on reset) and security information that
// allows the MCU to restrict access to the Flash Memory module.
// Placed at address 0x400 by the linker script.
//*****************************************************************************
__attribute__ ((used,section(".FlashConfig"))) const struct {
    unsigned int word1;
    unsigned int word2;
    unsigned int word3;
    unsigned int word4;
} Flash_Config = {0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0xFFFF7DFE};
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
WEAK void IntDefaultHandler(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void DMA0_IRQHandler(void);
WEAK void DMA1_IRQHandler(void);
WEAK void DMA2_IRQHandler(void);
WEAK void DMA3_IRQHandler(void);
WEAK void DMA4_IRQHandler(void);
WEAK void DMA5_IRQHandler(void);
WEAK void DMA6_IRQHandler(void);
WEAK void DMA7_IRQHandler(void);
WEAK void DMA8_IRQHandler(void);
WEAK void DMA9_IRQHandler(void);
WEAK void DMA10_IRQHandler(void);
WEAK void DMA11_IRQHandler(void);
WEAK void DMA12_IRQHandler(void);
WEAK void DMA13_IRQHandler(void);
WEAK void DMA14_IRQHandler(void);
WEAK void DMA15_IRQHandler(void);
WEAK void DMA_Error_IRQHandler(void);
WEAK void MCM_IRQHandler(void);
WEAK void FTFC_CMD_IRQHandler(void);
WEAK void FTFC_Read_Collision_IRQHandler(void);
WEAK void LVD_LVW_IRQHandler(void);
WEAK void FTFM_Fault_IRQHandler(void);
WEAK void WDOG_EWM_IRQHandler(void);
WEAK void RCM_IRQHandler(void);
WEAK void LPI2C0_Master_IRQHandler(void);
WEAK void LPI2C0_Slave_IRQHandler(void);
WEAK void LPSPI0_IRQHandler(void);
WEAK void LPSPI1_IRQHandler(void);
WEAK void LPSPI2_IRQHandler(void);
WEAK void LPI2C1_Master_IRQHandler(void);
WEAK void LPI2C1_Slave_IRQHandler(void);
WEAK void LPUART0_IRQHandler(void);
WEAK void Reserved48_IRQHandler(void);
WEAK void LPUART1_IRQHandler(void);
WEAK void Reserved50_IRQHandler(void);
WEAK void LPUART2_IRQHandler(void);
WEAK void Reserved52_IRQHandler(void);
WEAK void Reserved53_IRQHandler(void);
WEAK void Reserved54_IRQHandler(void);
WEAK void ADC0_IRQHandler(void);
WEAK void ADC1_IRQHandler(void);
WEAK void CMP0_IRQHandler(void);
WEAK void Reserved58_IRQHandler(void);
WEAK void Reserved59_IRQHandler(void);
WEAK void ERM_single_fault_IRQHandler(void);
WEAK void ERM_double_fault_IRQHandler(void);
WEAK void RTC_IRQHandler(void);
WEAK void RTC_Seconds_IRQHandler(void);
WEAK void LPIT0_Ch0_IRQHandler(void);
WEAK void LPIT0_Ch1_IRQHandler(void);
WEAK void LPIT0_Ch2_IRQHandler(void);
WEAK void LPIT0_Ch3_IRQHandler(void);
WEAK void PDB0_IRQHandler(void);
WEAK void Reserved69_IRQHandler(void);
WEAK void Reserved70_IRQHandler(void);
WEAK void SAI1_TX_SYNC_IRQHandler(void);
WEAK void SAI1_RX_SYNC_IRQHandler(void);
WEAK void SCG_IRQHandler(void);
WEAK void LPTMR0_IRQHandler(void);
WEAK void PORTA_IRQHandler(void);
WEAK void PORTB_IRQHandler(void);
WEAK void PORTC_IRQHandler(void);
WEAK void PORTD_IRQHandler(void);
WEAK void PORTE_IRQHandler(void);
WEAK void SWI_IRQHandler(void);
WEAK void QSPI_Ored_IRQHandler(void);
WEAK void Reserved82_IRQHandler(void);
WEAK void Reserved83_IRQHandler(void);
WEAK void PDB1_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void SAI0_TX_SYNC_IRQHandler(void);
WEAK void SAI0_RX_SYNC_IRQHandler(void);
WEAK void ENET_1588_Timer_IRQHandler(void);
WEAK void ENET_Transmit_IRQHandler(void);
WEAK void ENET_Receive_IRQHandler(void);
WEAK void ENET_Error_IRQHandler(void);
WEAK void ENET_Graceful_Stop_IRQHandler(void);
WEAK void ENET_Wake_IRQHandler(void);
WEAK void CAN0_ORed_Message_Buffer_IRQHandler(void);
WEAK void CAN0_Error_IRQHandler(void);
WEAK void CAN0_Wake_Up_IRQHandler(void);
WEAK void CAN0_ORed_0_15_MB_IRQHandler(void);
WEAK void CAN0_ORed_16_31_MB_IRQHandler(void);
WEAK void Reserved99_IRQHandler(void);
WEAK void Reserved100_IRQHandler(void);
WEAK void CAN1_ORed_Message_buffer_IRQHandler(void);
WEAK void CAN1_Error_IRQHandler(void);
WEAK void Reserved103_IRQHandler(void);
WEAK void CAN1_ORed_0_15_MB_IRQHandler(void);
WEAK void CAN1_ORed_16_31_MB_IRQHandler(void);
WEAK void Reserved106_IRQHandler(void);
WEAK void Reserved107_IRQHandler(void);
WEAK void CAN2_ORed_Message_buffer_IRQHandler(void);
WEAK void CAN2_Error_IRQHandler(void);
WEAK void Reserved110_IRQHandler(void);
WEAK void CAN2_ORed_0_15_MB_IRQHandler(void);
WEAK void CAN2_ORed_16_31_MB_IRQHandler(void);
WEAK void Reserved113_IRQHandler(void);
WEAK void Reserved114_IRQHandler(void);
WEAK void FTM0_Ch0_Ch1_IRQHandler(void);
WEAK void FTM0_Ch2_Ch3_IRQHandler(void);
WEAK void FTM0_Ch4_Ch5_IRQHandler(void);
WEAK void FTM0_Ch6_Ch7_IRQHandler(void);
WEAK void FTM0_Fault_IRQHandler(void);
WEAK void FTM0_Ovf_Reload_IRQHandler(void);
WEAK void FTM1_Ch0_Ch1_IRQHandler(void);
WEAK void FTM1_Ch2_Ch3_IRQHandler(void);
WEAK void FTM1_Ch4_Ch5_IRQHandler(void);
WEAK void FTM1_Ch6_Ch7_IRQHandler(void);
WEAK void FTM1_Fault_IRQHandler(void);
WEAK void FTM1_Ovf_Reload_IRQHandler(void);
WEAK void FTM2_Ch0_Ch1_IRQHandler(void);
WEAK void FTM2_Ch2_Ch3_IRQHandler(void);
WEAK void FTM2_Ch4_Ch5_IRQHandler(void);
WEAK void FTM2_Ch6_Ch7_IRQHandler(void);
WEAK void FTM2_Fault_IRQHandler(void);
WEAK void FTM2_Ovf_Reload_IRQHandler(void);
WEAK void FTM3_Ch0_Ch1_IRQHandler(void);
WEAK void FTM3_Ch2_Ch3_IRQHandler(void);
WEAK void FTM3_Ch4_Ch5_IRQHandler(void);
WEAK void FTM3_Ch6_Ch7_IRQHandler(void);
WEAK void FTM3_Fault_IRQHandler(void);
WEAK void FTM3_Ovf_Reload_IRQHandler(void);
WEAK void FTM4_Ch0_Ch1_IRQHandler(void);
WEAK void FTM4_Ch2_Ch3_IRQHandler(void);
WEAK void FTM4_Ch4_Ch5_IRQHandler(void);
WEAK void FTM4_Ch6_Ch7_IRQHandler(void);
WEAK void FTM4_Fault_IRQHandler(void);
WEAK void FTM4_Ovf_Reload_IRQHandler(void);
WEAK void FTM5_Ch0_Ch1_IRQHandler(void);
WEAK void FTM5_Ch2_Ch3_IRQHandler(void);
WEAK void FTM5_Ch4_Ch5_IRQHandler(void);
WEAK void FTM5_Ch6_Ch7_IRQHandler(void);
WEAK void FTM5_Fault_IRQHandler(void);
WEAK void FTM5_Ovf_Reload_IRQHandler(void);
WEAK void FTM6_Ch0_Ch1_IRQHandler(void);
WEAK void FTM6_Ch2_Ch3_IRQHandler(void);
WEAK void FTM6_Ch4_Ch5_IRQHandler(void);
WEAK void FTM6_Ch6_Ch7_IRQHandler(void);
WEAK void FTM6_Fault_IRQHandler(void);
WEAK void FTM6_Ovf_Reload_IRQHandler(void);
WEAK void FTM7_Ch0_Ch1_IRQHandler(void);
WEAK void FTM7_Ch2_Ch3_IRQHandler(void);
WEAK void FTM7_Ch4_Ch5_IRQHandler(void);
WEAK void FTM7_Ch6_Ch7_IRQHandler(void);
WEAK void FTM7_Fault_IRQHandler(void);
WEAK void FTM7_Ovf_Reload_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void DMA0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_Error_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MCM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTFC_CMD_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTFC_Read_Collision_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LVD_LVW_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTFM_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void WDOG_EWM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RCM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C0_Master_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C0_Slave_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C1_Master_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C1_Slave_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved48_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved50_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved52_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved53_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved54_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CMP0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved58_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved59_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ERM_single_fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ERM_double_fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC_Seconds_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT0_Ch0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT0_Ch2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT0_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDB0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved69_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved70_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI1_TX_SYNC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI1_RX_SYNC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SCG_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPTMR0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTB_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTD_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SWI_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void QSPI_Ored_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved82_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved83_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDB1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXIO_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI0_TX_SYNC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI0_RX_SYNC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENET_1588_Timer_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENET_Transmit_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENET_Receive_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENET_Error_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENET_Graceful_Stop_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENET_Wake_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved99_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved100_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved103_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved106_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved107_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved110_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved113_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved114_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM0_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM0_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM0_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM0_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM0_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM0_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM1_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM1_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM1_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM1_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM1_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM1_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM2_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM2_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM2_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM2_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM2_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM2_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM3_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM3_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM3_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM3_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM3_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM3_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM4_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM4_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM4_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM4_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM4_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM4_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM5_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM5_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM5_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM5_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM5_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM5_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM6_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM6_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM6_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM6_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM6_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM6_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM7_Ch0_Ch1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM7_Ch2_Ch3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM7_Ch4_Ch5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM7_Ch6_Ch7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM7_Fault_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTM7_Ovf_Reload_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#endif
extern int main(void);

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
extern void _vStackTop(void);
//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************

