nxp-mcuxpresso/mcux-devices-mcx/MCXE/MCXE247/mcuxpresso/startup_mcxe247.cpp
WEAK void FTM3_Ch4_Ch5_IRQHandler(void)
{   FTM3_Ch4_Ch5_DriverIRQHandler();
}

WEAK void FTM3_Ch6_Ch7_IRQHandler(void)
{   FTM3_Ch6_Ch7_DriverIRQHandler();
}

WEAK void FTM3_Fault_IRQHandler(void)
{   FTM3_Fault_DriverIRQHandler();
}

WEAK void FTM3_Ovf_Reload_IRQHandler(void)
{   FTM3_Ovf_Reload_DriverIRQHandler();
}

WEAK void FTM4_Ch0_Ch1_IRQHandler(void)
{   FTM4_Ch0_Ch1_DriverIRQHandler();
}

WEAK void FTM4_Ch2_Ch3_IRQHandler(void)
{   FTM4_Ch2_Ch3_DriverIRQHandler();
}

WEAK void FTM4_Ch4_Ch5_IRQHandler(void)
{   FTM4_Ch4_Ch5_DriverIRQHandler();
}

WEAK void FTM4_Ch6_Ch7_IRQHandler(void)
{   FTM4_Ch6_Ch7_DriverIRQHandler();
}

WEAK void FTM4_Fault_IRQHandler(void)
{   FTM4_Fault_DriverIRQHandler();
}

WEAK void FTM4_Ovf_Reload_IRQHandler(void)
{   FTM4_Ovf_Reload_DriverIRQHandler();
}

WEAK void FTM5_Ch0_Ch1_IRQHandler(void)
{   FTM5_Ch0_Ch1_DriverIRQHandler();
}

WEAK void FTM5_Ch2_Ch3_IRQHandler(void)
{   FTM5_Ch2_Ch3_DriverIRQHandler();
}

WEAK void FTM5_Ch4_Ch5_IRQHandler(void)
{   FTM5_Ch4_Ch5_DriverIRQHandler();
}

WEAK void FTM5_Ch6_Ch7_IRQHandler(void)
{   FTM5_Ch6_Ch7_DriverIRQHandler();
}

WEAK void FTM5_Fault_IRQHandler(void)
{   FTM5_Fault_DriverIRQHandler();
}

WEAK void FTM5_Ovf_Reload_IRQHandler(void)
{   FTM5_Ovf_Reload_DriverIRQHandler();
}

WEAK void FTM6_Ch0_Ch1_IRQHandler(void)
{   FTM6_Ch0_Ch1_DriverIRQHandler();
}

WEAK void FTM6_Ch2_Ch3_IRQHandler(void)
{   FTM6_Ch2_Ch3_DriverIRQHandler();
}

WEAK void FTM6_Ch4_Ch5_IRQHandler(void)
{   FTM6_Ch4_Ch5_DriverIRQHandler();
}

WEAK void FTM6_Ch6_Ch7_IRQHandler(void)
{   FTM6_Ch6_Ch7_DriverIRQHandler();
}

WEAK void FTM6_Fault_IRQHandler(void)
{   FTM6_Fault_DriverIRQHandler();
}

WEAK void FTM6_Ovf_Reload_IRQHandler(void)
{   FTM6_Ovf_Reload_DriverIRQHandler();
}

WEAK void FTM7_Ch0_Ch1_IRQHandler(void)
{   FTM7_Ch0_Ch1_DriverIRQHandler();
}

WEAK void FTM7_Ch2_Ch3_IRQHandler(void)
{   FTM7_Ch2_Ch3_DriverIRQHandler();
}

WEAK void FTM7_Ch4_Ch5_IRQHandler(void)
{   FTM7_Ch4_Ch5_DriverIRQHandler();
}

WEAK void FTM7_Ch6_Ch7_IRQHandler(void)
{   FTM7_Ch6_Ch7_DriverIRQHandler();
}

WEAK void FTM7_Fault_IRQHandler(void)
{   FTM7_Fault_DriverIRQHandler();
}

WEAK void FTM7_Ovf_Reload_IRQHandler(void)
{   FTM7_Ovf_Reload_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
